/** 用户名正则 */
export const REG_USER_NAME = /^[\u4E00-\u9FA5\w-]{4,16}$/;

/** 手机号码正则 */
export const REG_PHONE
  = /^1((3\d)|(4[014-9])|(5[0-35-9])|(6[2567])|(7[0-8])|(8\d)|(9[0-35-9]))\d{8}$/;

/** 邮箱正则 */
export const REG_EMAIL = /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/;

/** 密码正则(密码为6-18位数字/字符/符号的组合) */
export const REG_PWD
  = /^(?!\d+$)(?![a-z]+$)(?![A-Z]+$)(?!([^(0-9a-zA-Z)]|[()])+$)(?![^\n\r\u2028\u2029\u4E00-\u9FA5]*[\u4E00-\u9FA5].*$)([\s\S]){6,18}$/;

/** 6位数字验证码正则 */
export const REG_CODE_SIX = /^\d{6}$/;

/** 4位数字验证码正则 */
export const REG_CODE_FOUR = /^\d{4}$/;

/** url链接正则 */
export const REG_URL = /^https?:\/\/(?:[-;:&=+$,\w]+@)?[A-Za-z0-9.-]+(?::\d+)?(?:\/[+~%/\w-]*)?(?:\?[+=&;%@\w.-]*)?(?:#\w*)?$|^www\.[A-Za-z0-9.-]+(?:\/[+~%/\w-]*)?(?:\?[+=&;%@\w.-]*)?(?:#\w*)?$/;
